Version2/TestTool 1.2 Service Release/TestTool.Setup/Requests/Device Management/SetUser/TC.DM.NVT.30_REQ_06.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
               xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetUser>
      <tds:User>
        <tt:Username>TestAdmin2</tt:Username>
        <tt:Password>12345</tt:Password>
        <tt:UserLevel>Administrator</tt:UserLevel>
      </tds:User>
      <tds:User>
        <tt:Username>TestUser2</tt:Username>
        <tt:Password>123</tt:Password>
        <tt:UserLevel>User</tt:UserLevel>
      </tds:User>
      <tds:User>
        <tt:Username>TestOperator2</tt:Username>
        <tt:Password>123</tt:Password>
        <tt:UserLevel>Operator</tt:UserLevel>
      </tds:User>
    </tds:SetUser>
  </soap:Body>
</soap:Envelope>