nxvpro/Resources/soap_modify_user.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <SetUser
            xmlns="http://www.onvif.org/ver10/device/wsdl">
            <User>
                <Username>_USER_</Username>
                <Password>_PWD_</Password>
                <UserLevel>_ROLE_</UserLevel>
            </User>
        </SetUser>
    </s:Body>
</s:Envelope>
